Repository: bgoktugozdemir-dev/AI-Powered-Travel-Assistant
Catalog: lib/l10n/app_*.arb
Languages: tr

# appTitle
source: Travel Assistant
tr: Seyahat Asistanı

# travelFormStepTitle
source: Step {stepNumber}
tr: Adım {stepNumber}

source: OK
tr: Tamam

source: Cancel
tr: İptal

# departureAirportStepTitle
source: Where are you flying from?
tr: Nereden uçuyorsunuz?

# departureAirportHintText
source: Search departure airport (e.g., IST, Istanbul)
tr: Kalkış havalimanı ara (ör. IST, İstanbul)

# arrivalAirportStepTitle
source: Where are you flying to?
tr: Nereye uçuyorsunuz?

# arrivalAirportHintText
source: Search arrival airport (e.g., JFK, New York)
tr: Varış havalimanı ara (ör. JFK, New York)

# travelDatesStepTitle
source: When are you travelling?
tr: Ne zaman seyahat ediyorsunuz?

# selectDatesButtonLabel
source: Select Travel Dates
tr: Seyahat Tarihlerini Seç

# selectedDatesLabel
source: Selected: {startDate} - {endDate}
tr: Seçilen: {startDate} - {endDate}

source: No dates selected
tr: Tarih seçilmedi

# nationalityStepTitle
source: What is your nationality?
tr: Milliyetiniz nedir?

# nationalityHintText
source: Search your nationality (e.g., US, Turkey)
tr: Milliyetinizi arayın (ör. TR, ABD)

# selectedNationalityLabel
source: Selected: {nationalityName}
tr: Seçilen: {nationalityName}

# travelPurposeStepTitle
source: What are your travel purposes?
tr: Seyahat amaçlarınız nelerdir?

source: Select Travel Purposes
tr: Seyahat Amaçlarını Seçin

# selectTravelPurposesDescription
source: Choose one or more reasons for your trip. This helps us provide better recommendations.
tr: Seyahatiniz için bir veya daha fazla amaç seçin. Bu, daha iyi öneriler sunmamıza yardımcı olur.

source: Selected Purposes
tr: Seçilen Amaçlar

# noPurposesAvailable
source: No travel purposes available. Please try again later.
tr: Seyahat amaçları bulunamadı. Lütfen daha sonra tekrar deneyiniz.

# travelFormErrorTitle
source: Error Occurred
tr: Hata Oluştu

# validationErrorTravelPurposeMissing
source: {minimumTravelPurposes, plural, =1{Please select at least 1 travel purpose. You have selected {selectedTravelPurposes}.} other{Please select at least {minimumTravelPurposes} travel purposes. You have selected {selectedTravelPurposes}.}}
tr: {minimumTravelPurposes, plural, =1{Lütfen en az 1 seyahat amacı seçin. {selectedTravelPurposes} adet seçtiniz.} other{Lütfen en az {minimumTravelPurposes} seyahat amacı seçin. {selectedTravelPurposes} adet seçtiniz.}}

# validationErrorTravelPurposeTooMany
source: {maximumTravelPurposes, plural, =1{Please select no more than 1 travel purpose. You have selected {selectedTravelPurposes}.} other{Please select no more than {maximumTravelPurposes} travel purposes. You have selected {selectedTravelPurposes}.}}
tr: {maximumTravelPurposes, plural, =1{Lütfen en fazla 1 seyahat amacı seçin. {selectedTravelPurposes} adet seçtiniz.} other{Lütfen en fazla {maximumTravelPurposes} seyahat amacı seçin. {selectedTravelPurposes} adet seçtiniz.}}

# validationErrorNationalityMissing
source: Please select your nationality.
tr: Lütfen milliyetinizi seçin.

# errorInvalidDateRange
source: End date cannot be before start date.
tr: Bitiş tarihi başlangıç tarihinden önce olamaz.

# validationErrorDepartureAirportMissing
source: Please select a departure airport.
tr: Lütfen bir kalkış havalimanı seçin.

# validationErrorArrivalAirportMissing
source: Please select an arrival airport.
tr: Lütfen bir varış havalimanı seçin.

# validationErrorDateRangeMissing
source: Please select travel dates.
tr: Lütfen seyahat tarihlerini seçin.

# errorGeneralTravelForm
source: An unexpected error occurred. Please try again.
tr: Beklenmedik bir hata oluştu. Lütfen tekrar deneyin.

# errorServer
source: Server error occurred. Please try again later.
tr: Sunucu hatası oluştu. Lütfen daha sonra tekrar deneyin.

# selectedAirportLabel
source: Selected: {airportName} ({airportCode})
tr: Seçilen: {airportName} ({airportCode})

# navigationPrevious
source: Previous
tr: Önceki

# navigationNext
source: Next
tr: Sonraki

# navigationSubmit
source: Get Travel Plan
tr: Seyahat Planı Al

# submittingForm
source: Crafting your perfect adventure...
tr: Mükemmel maceranız hazırlanıyor...

source: Your Travel Plan
tr: Seyahat Planınız

# fromLabel
source: From
tr: Nereden

# toLabel
source: To
tr: Nereye

# datesLabel
source: Dates
tr: Tarihler

# nationalityLabel
source: Nationality
tr: Milliyet

# travelPurposesLabel
source: Travel Purposes
tr: Seyahat Amaçları

# recommendationsTitle
source: Recommendations
tr: Öneriler

source: Plan Another Trip
tr: Başka Bir Seyahat Planla

# flightDurationFormat
source: {hours}h {minutes}m
tr: {hours}s {minutes}d

# flightOptionsTitle
source: Flight Options
tr: Uçuş Seçenekleri

# cheapestOptionTitle
source: Cheapest Option
tr: En Uygun Seçenek

# comfortableOptionTitle
source: Comfortable Option
tr: Rahat Seçenek

# recommendedOptionTitle
source: Recommended Option
tr: Önerilen Seçenek

# outboundFlightLabel
source: Outbound Flight
tr: Gidiş Uçuşu

# returnFlightLabel
source: Return Flight
tr: Dönüş Uçuşu

# stopsLabel
source: {count} stops
tr: {count} durak

# stopsCountLabel
source: Stops: {count}
tr: Duraklar: {count}

# cityInformationTitle
source: City Information
tr: Şehir Bilgisi

# cityCardCrowdLevelLabel
source: Crowd Level
tr: Kalabalık Seviyesi

# cityCardWeatherForecastTitle
source: Weather Forecast
tr: Hava Durumu Tahmini

# photoAttributionFormat
source: Photo by {photographerName} on Unsplash
tr: Fotoğraf: {photographerName} (Unsplash)

# disclaimerAIMistakesTitle
source: Important Disclaimer
tr: Önemli Uyarı

# disclaimerAIMistakesContent
source: The travel information provided is generated by AI and may contain inaccuracies or be incomplete. Always verify critical details like visa requirements, flight schedules, and safety advisories from official sources before making any travel plans.
tr: Sağlanan seyahat bilgileri yapay zeka tarafından üretilmiştir ve yanlışlıklar veya eksiklikler içerebilir. Herhangi bir seyahat planı yapmadan önce vize gereksinimleri, uçuş programları ve güvenlik uyarıları gibi kritik bilgileri her zaman resmi kaynaklardan doğrulayın.

# disclaimerLegalTitle
source: Legal Notice
tr: Yasal Uyarı

# disclaimerLegalContent
source: This application provides travel assistance and information for general guidance only. We are not responsible for any errors, omissions, or issues arising from the use of this information. Users are solely responsible for their travel decisions and for verifying all information with official and reliable sources.
tr: Bu uygulama yalnızca genel rehberlik amacıyla seyahat yardımı ve bilgileri sağlar. Bu bilgilerin kullanımından kaynaklanan herhangi bir hata, eksiklik veya sorundan sorumlu değiliz. Kullanıcılar seyahat kararlarından ve tüm bilgileri resmi ve güvenilir kaynaklardan doğrulamaktan yalnızca kendileri sorumludur.

# stepTitleWelcome
source: Let's plan your next adventure!
tr: Bir sonraki maceranızı planlayalım!

# stepTitleArrival
source: Where will your adventure take you?
tr: Maceranız sizi nereye götürecek?

# stepTitleDates
source: When does the magic happen?
tr: Sihir ne zaman gerçekleşecek?

# stepTitleNationality
source: Tell us about yourself!
tr: Bize kendinizden bahsedin!

# stepTitlePurpose
source: What's calling you to explore?
tr: Sizi keşfe çağıran nedir?

# stepTitleReview
source: Almost there!
tr: Neredeyse bitti!

# stepDescriptionDeparture
source: Where will your journey begin? Enter your departure airport to get started.
tr: Yolculuğunuz nerede başlayacak? Başlamak için kalkış havalimanınızı girin.

# stepDescriptionArrival
source: Where are you headed? Choose your arrival destination from our airport suggestions.
tr: Nereye gidiyorsunuz? Havalimanı önerilerimizden varış hedefinizi seçin.

# stepDescriptionDates
source: When would you like to travel? Select your departure and return dates for the trip.
tr: Ne zaman seyahat etmek istiyorsunuz? Gidiş ve dönüş tarihlerinizi seçin.

# stepDescriptionNationality
source: What's your nationality? This helps us provide accurate visa and travel requirements.
tr: Milliyetiniz nedir? Bu, doğru vize ve seyahat gereksinimlerini sağlamamıza yardımcı olur.

# stepDescriptionPurpose
source: What's the purpose of your trip? Select all that apply to get personalized recommendations.
tr: Seyahatinizin amacı nedir? Kişiselleştirilmiş öneriler almak için uygun olanların tümünü seçin.

# stepDescriptionReview
source: Review your travel details below and get your AI-generated travel plan!
tr: Aşağıdaki seyahat detaylarınızı gözden geçirin ve AI tarafından oluşturulan seyahat planınızı alın!

# currencyInformationTitle
source: Currency Information
tr: Para Birimi Bilgisi

# currencyLabel
source: Currency
tr: Para Birimi

# exchangeRateLabel
source: Exchange Rate
tr: Döviz Kuru

# averageDailyCostLabel
source: Average Daily Living Cost
tr: Ortalama Günlük Yaşam Maliyeti

# taxInformationTitle
source: Tax Information
tr: Vergi Bilgisi

# taxRateLabel
source: Tax Rate
tr: Vergi Oranı

# taxFreeShoppingLabel
source: Tax-Free Shopping
tr: Vergisiz Alışveriş

# refundableTaxRateLabel
source: Refundable Tax Rate
tr: İade Edilebilir Vergi Oranı

# availableLabel
source: Available
tr: Mevcut

# notAvailableLabel
source: Not Available
tr: Mevcut Değil

# placesToVisitTitle
source: Places to Visit
tr: Gezilecek Yerler

# requirementsLabel
source: Requirements:
tr: Gereksinimler:

# closeLabel
source: Close
tr: Kapat

# travelItineraryTitle
source: Travel Itinerary
tr: Seyahat Programı

# crowdLevelLabel
source: Crowd:
tr: Kalabalık:

# timeDifferenceTooltip
source: Time difference: {hours} hours
tr: Saat farkı: {hours} saat

# requiredDocumentsTitle
source: Required Documents
tr: Gerekli Belgeler

# requiredStepsLabel
source: Required Steps:
tr: Gerekli Adımlar:

# formValidationError
source: Please complete all required fields
tr: Lütfen form girişlerinizi kontrol edin ve tekrar deneyin.
